Revit 2026 API

# Definition Properties

---

The Definition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | The user visible name for the parameter. |

#### Reference

Definition Class

Autodesk.Revit.DB Namespace